10/data/attachments/222de4f48fdc4965.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_here_Friend_9823_5</nif:username>
            <nif:friendToBeRequested>soap_friends_cd72e90a-4f6b-4d2f-8072-71fdbca03d0f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>